src/Documents/ОтсутствиеНаРаботеОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ОтсутствиеНаРаботеОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостояниеРаботниковОрганизаций</xr:Item>
				<xr:Item>InformationRegister.ПериодыСостоянийРаботниковОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ЗанятыеШтатныеЕдиницыОрганизаций</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаботникиОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтсутствия</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияРаботникаОрганизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсвобождатьСтавку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерБЛ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаНетрудоспособности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПричиныНетрудоспособности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БуквенныйКод</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторИспользованияРабочегоВремени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавокЗавершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделениеЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизацииЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботыЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостоянияЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрядЕТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышенныйКоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИтоговоеПовышениеПоИнструкции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Временно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавкаПервогоРазряда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСтавкиПервогоРазряда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловияТрудаИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДеятельностиИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРаботника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЕТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкладВВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДляПечати</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсключитьИзПУ2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ауМестоРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СЭ_МестаРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременныйПереводКлимовичи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРаботникаУдалить</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СостояниеРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостояниеРаботниковОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияРаботникаОрганизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияРаботникаОрганизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ПериодыСостоянийРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПериодыСостоянийРаботниковОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/ОтсутствиеНаРаботеОрганизаций/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем мДлинаСуток;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры:
//	Режим - режим проведения
//
// Возвращаемое значение:
//	Результат запроса
//
Функция СформироватьЗапросПоШапке(Режим)
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",		Ссылка);
	Запрос.УстановитьПараметр("ПустаяОрганизация",	Справочники.Организации.ПустаяСсылка());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтсутствиеНаРаботеОрганизаций.Дата,
	|	ОтсутствиеНаРаботеОрганизаций.Организация,
	|	ВЫБОР КОГДА ОтсутствиеНаРаботеОрганизаций.Организация.ГоловнаяОрганизация = &ПустаяОрганизация ТОГДА ОтсутствиеНаРаботеОрганизаций.Организация ИНАЧЕ ОтсутствиеНаРаботеОрганизаций.Организация.ГоловнаяОрганизация КОНЕЦ КАК ГоловнаяОрганизация,
	|	ОтсутствиеНаРаботеОрганизаций.Ссылка
	|ИЗ
	|	Документ.ОтсутствиеНаРаботеОрганизаций КАК ОтсутствиеНаРаботеОрганизаций
	|
	|ГДЕ
	|	ОтсутствиеНаРаботеОрганизаций.Ссылка = &ДокументСсылка";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоШапке()

// Формирует запрос по таблице "РаботникиОрганизации" документа
//
// Параметры:
//	Режим	- режим проведения
//
// Возвращаемое значение:
//	Результат запроса. В запросе данные документа дополняются значениями
//	проверяемых параметров из связанного с
//
Функция СформироватьЗапросПоРаботникиОрганизации(ВыборкаПоШапкеДокумента)
	
	Запрос = Новый Запрос;
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ВыборкаПоШапкеДокумента.ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("ПустаяДата",	'00010101');
	
	
	// Описание текста запроса:
	// 1. Выборка "СтрокиДокумента": 
	//	Во вложенном запросе выбираются строки документа, к ним добавляется 
	//	дата предшествующего "дате начала" движения из рег-ра РаботникиОрганизации
	//
	// 2. Выборка "РаботникиОрганизации": 
	//	Для каждой строки документа выполняем срез по регистру РаботникиОрганизации на 
	//	дату ДатаНачала для выполнения движений по штатному расписаниюи и проверки, 
	//	работает ли работник на эту дату (использует данные выборки "СтрокиДокумента")
	//
	// 3. Выборка "ПересекающиесяСтроки": 
	//	Среди остальных строк документа ищем строки, имеющие ту же дату ДатаНачала
	//
	// 4. Выборка "ИмеющиесяСостояния": 
	//	В рег-ре СостояниеРаботниковОрганизации ищем движения на дату ДатаНачала
	//
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА  СтрокиДокумента.ДатаНачала >= РаботникиОрганизации.ПериодЗавершения 
	|				И РаботникиОрганизации.ПериодЗавершения <> &ПустаяДата
	|		ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения
	|		ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации
	|	КОНЕЦ КАК ПодразделениеОрганизации,
	|	ВЫБОР
	|		КОГДА СтрокиДокумента.ДатаНачала >= РаботникиОрганизации.ПериодЗавершения 
	|				И РаботникиОрганизации.ПериодЗавершения <> &ПустаяДата
	|		ТОГДА РаботникиОрганизации.ДолжностьЗавершения
	|		ИНАЧЕ РаботникиОрганизации.Должность 
	|	КОНЕЦ КАК Должность,
	|	ВЫБОР
	|		КОГДА СтрокиДокумента.ДатаНачала >= РаботникиОрганизации.ПериодЗавершения 
	|				И РаботникиОрганизации.ПериодЗавершения <> &ПустаяДата
	|		ТОГДА РаботникиОрганизации.ЗанимаемыхСтавокЗавершения
	|		ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
	|	КОНЕЦ КАК ЗанимаемыхСтавок,
	|	СтрокиДокумента.НомерСтроки,
	|	СтрокиДокумента.ДатаНачала,
	|	СтрокиДокумента.Сотрудник,
	|	СтрокиДокумента.Сотрудник.Наименование,
	|	РаботникиОрганизации.Сотрудник.Физлицо КАК Физлицо,
	|	СтрокиДокумента.ОсвобождатьСтавку,
	|	СтрокиДокумента.ПричинаОтсутствия,
	|	СтрокиДокумента.Ссылка,
	|	СтрокиДокумента.ДатаИзменения,
	|	ВЫБОР
	|		КОГДА СтрокиДокумента.Сотрудник.Организация = &ГоловнаяОрганизация
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации,
	|	МИНИМУМ(ПересекающиесяСтроки.НомерСтроки) КАК КонфликтнаяСтрока,
	|	ИмеющиесяСостояния.Состояние КАК КонфликтноеСостояние,
	|	ИмеющиесяСостояния.Регистратор.Представление КАК КонфликтныйДокумент
	|ИЗ
	|	(ВЫБРАТЬ
	|		Док.НомерСтроки КАК НомерСтроки,
	|		Док.ДатаНачала КАК ДатаНачала,
	|		Док.Сотрудник КАК Сотрудник,
	|		Док.ОсвобождатьСтавку КАК ОсвобождатьСтавку,
	|		Док.ПричинаОтсутствия КАК ПричинаОтсутствия,
	|		Док.Ссылка КАК Ссылка,
	|		МАКСИМУМ(Работники.Период) КАК ДатаИзменения
	|	ИЗ
	|		Документ.ОтсутствиеНаРаботеОрганизаций.РаботникиОрганизации КАК Док
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники
	|			ПО Док.ДатаНачала >= Работники.Период
	|				И Док.Сотрудник = Работники.Сотрудник
	|	ГДЕ
	|		Док.Ссылка = &ДокументСсылка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Док.НомерСтроки,
	|		Док.ДатаНачала,
	|		Док.ОсвобождатьСтавку,
	|		Док.ПричинаОтсутствия,
	|		Док.Ссылка,
	|		Док.Сотрудник) КАК СтрокиДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|		ПО СтрокиДокумента.ДатаИзменения = РаботникиОрганизации.Период
	|			И СтрокиДокумента.Сотрудник = РаботникиОрганизации.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтсутствиеНаРаботеОрганизаций.РаботникиОрганизации КАК ПересекающиесяСтроки
	|		ПО СтрокиДокумента.Ссылка = ПересекающиесяСтроки.Ссылка
	|			И СтрокиДокумента.ДатаНачала = ПересекающиесяСтроки.ДатаНачала
	|			И СтрокиДокумента.НомерСтроки < ПересекающиесяСтроки.НомерСтроки
	|			И СтрокиДокумента.Сотрудник = ПересекающиесяСтроки.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботниковОрганизаций КАК ИмеющиесяСостояния
	|		ПО СтрокиДокумента.ДатаНачала = ИмеющиесяСостояния.Период
	|			И СтрокиДокумента.Ссылка <> ИмеющиесяСостояния.Регистратор
	|			И СтрокиДокумента.Сотрудник = ИмеющиесяСостояния.Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА  СтрокиДокумента.ДатаНачала >= РаботникиОрганизации.ПериодЗавершения 
	|				И РаботникиОрганизации.ПериодЗавершения <> &ПустаяДата
	|		ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения
	|		ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СтрокиДокумента.ДатаНачала >= РаботникиОрганизации.ПериодЗавершения 
	|				И РаботникиОрганизации.ПериодЗавершения <> &ПустаяДата
	|		ТОГДА РаботникиОрганизации.ДолжностьЗавершения
	|		ИНАЧЕ РаботникиОрганизации.Должность 
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СтрокиДокумента.ДатаНачала >= РаботникиОрганизации.ПериодЗавершения 
	|				И РаботникиОрганизации.ПериодЗавершения <> &ПустаяДата
	|		ТОГДА РаботникиОрганизации.ЗанимаемыхСтавокЗавершения
	|		ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
	|	КОНЕЦ,
	|	СтрокиДокумента.НомерСтроки,
	|	СтрокиДокумента.ДатаНачала,
	|	СтрокиДокумента.ОсвобождатьСтавку,
	|	СтрокиДокумента.ПричинаОтсутствия,
	|	СтрокиДокумента.Ссылка,
	|	ИмеющиесяСостояния.Состояние,
	|	ИмеющиесяСостояния.Регистратор.Представление,
	|	СтрокиДокумента.ДатаИзменения,
	|	СтрокиДокумента.Сотрудник,
	|	СтрокиДокумента.Сотрудник.Наименование,
	|	РаботникиОрганизации.Сотрудник.Физлицо";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоРаботникиОрганизации()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//	ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//	Отказ 					- флаг отказа в проведении,
//	Заголовок				- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок)
	
	// Организация
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения реквизитов в строке ТЧ "РаботникиОрганизации" документа.
// Если какой-то из реквизтов, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по строке ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры:
//	ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//	ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//								  из результата запроса по товарам документа, 
//	Отказ						- флаг отказа в проведении,
//	Заголовок					- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок)
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Работники организации"": ";
	
	// Сотрудник
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не выбран сотрудник!", Отказ, Заголовок);
	КонецЕсли;
	
	// Организация сотрудника должна совпадать с организацией документа
	Если ВыборкаПоСтрокамДокумента.ОшибкаНеСоответствиеСотрудникаИОрганизации Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "указанный сотрудник оформлен на другую организацию!", Отказ, Заголовок);
	КонецЕсли;
	
	// Дата "с"
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаНачала) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата изменения состояния!", Отказ, Заголовок);
	КонецЕсли;
	
	// Причина отсутствия
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ПричинаОтсутствия) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указано состояние!", Отказ, Заголовок);
	КонецЕсли;
	
	// Работник не должен быть уволенным.
	Если ВыборкаПоСтрокамДокумента.ЗанимаемыхСтавок = 0 Тогда
		СтрокаСообщениеОбОшибке = "на " + Формат(ВыборкаПоСтрокамДокумента.ДатаНачала, "ДЛФ=DD") + " работник " + ВыборкаПоСтрокамДокумента.СотрудникНаименование + " уже уволен (с " + Формат(ВыборкаПоСтрокамДокумента.ДатаИзменения, "ДЛФ=DD") + ")!";
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщениеОбОшибке, Отказ, Заголовок);
	КонецЕсли;
	
	// Проверка: противоречие другой строке документа
	Если ВыборкаПоСтрокамДокумента.КонфликтнаяСтрока <> NULL Тогда
		СтрокаСообщениеОбОшибке = "в строке " + ВыборкаПоСтрокамДокумента.КонфликтнаяСтрока + " указана та же дата изменения состояния!"; 
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщениеОбОшибке, Отказ, Заголовок);
	КонецЕсли;
	
	// Проверка: в регистре уже есть такое движение
	//ПСА 29.01.2021 СВФР-007141 +++
	//Если ВыборкаПоСтрокамДокумента.КонфликтноеСостояние <> NULL Тогда
	Если ВыборкаПоСтрокамДокумента.КонфликтноеСостояние <> NULL и ВыборкаПоСтрокамДокумента.ПричинаОтсутствия <> Перечисления.СостоянияРаботникаОрганизации.Прогулы 
		
		//Аверсон ЕАЕ 28.05.2021 
		И ВыборкаПоСтрокамДокумента.ПричинаОтсутствия <> Перечисления.СостоянияРаботникаОрганизации.ГосударственныеОбязанности Тогда
		//Аверсон
		
		//+++ПСА 29.01.2021 СВФР-007141 
		
		//Аверсон 08.05.2021 КВВ СВФР-007558 (
		Если НЕ ((Организация.ИНН = "700067572" 
			ИЛИ Организация.ИНН = "100194961" //СВЭЙ 22.05.2024 КВВ СВФР-013068
			ИЛИ Организация.ИНН = "806000046") //Аверсон 27.10.2021 КВВ СВФР-008084 (пункт 3)
			И (
			ВыборкаПоСтрокамДокумента.ПричинаОтсутствия = Перечисления.СостоянияРаботникаОрганизации.Заболевание
			//Аверсон 18.11.2021 КВВ СВФР-008392 ( 
			ИЛИ ВыборкаПоСтрокамДокумента.ПричинаОтсутствия = Перечисления.СостоянияРаботникаОрганизации.БольничныйПоБеременностиИРодам
			ИЛИ ВыборкаПоСтрокамДокумента.ПричинаОтсутствия = Перечисления.СостоянияРаботникаОрганизации.ОтпускПоБеременностиИРодам
			//Аверсон 18.11.2021 КВВ СВФР-008392 )
			
			//Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 8) (
			ИЛИ ВыборкаПоСтрокамДокумента.ПричинаОтсутствия = Перечисления.СостоянияРаботникаОрганизации.Прогулы
			ИЛИ ВыборкаПоСтрокамДокумента.ПричинаОтсутствия = Перечисления.СостоянияРаботникаОрганизации.ДеньДонора
			ИЛИ ВыборкаПоСтрокамДокумента.ПричинаОтсутствия = Перечисления.СостоянияРаботникаОрганизации.ДеньДонораБезОплаты
			ИЛИ ВыборкаПоСтрокамДокумента.ПричинаОтсутствия = Перечисления.СостоянияРаботникаОрганизации.СправкаПоУходуЗаРебенком
			ИЛИ ВыборкаПоСтрокамДокумента.ПричинаОтсутствия = Перечисления.СостоянияРаботникаОрганизации.ПодСледствием
			ИЛИ ВыборкаПоСтрокамДокумента.ПричинаОтсутствия = Перечисления.СостоянияРаботникаОрганизации.Медкомиссия
			ИЛИ ВыборкаПоСтрокамДокумента.ПричинаОтсутствия = Перечисления.СостоянияРаботникаОрганизации.АлкогольноеНаркотическоеОпьянение
			ИЛИ ВыборкаПоСтрокамДокумента.ПричинаОтсутствия = Перечисления.СостоянияРаботникаОрганизации.Ремонт
			ИЛИ ВыборкаПоСтрокамДокумента.ПричинаОтсутствия = Перечисления.СостоянияРаботникаОрганизации.ГосударственныеОбязанности
			ИЛИ ВыборкаПоСтрокамДокумента.ПричинаОтсутствия = Перечисления.СостоянияРаботникаОрганизации.ОтсутствиеПоИнициативеНанимателя //Аверсон 18.04.2023 КВВ СВФР-010714
			ИЛИ ВыборкаПоСтрокамДокумента.ПричинаОтсутствия = Перечисления.СостоянияРаботникаОрганизации.ОплатаПоСреднемуЗаработку
			ИЛИ ВыборкаПоСтрокамДокумента.ПричинаОтсутствия = Перечисления.СостоянияРаботникаОрганизации.ОплатаПоСреднемуЗаработкуСоревнования //Аверсон 23.08.2023 КВВ СВФР-011294
			) 
			//Аверсон 24.10.2021 КВВ СВФР-008152 (пункт 8) )
			И(Найти(Нрег(ВыборкаПоСтрокамДокумента.КонфликтныйДокумент),"отзыв из отпуска")> 0 
			ИЛИ Найти(Нрег(ВыборкаПоСтрокамДокумента.КонфликтныйДокумент),"отпуска организаций")> 0
			ИЛИ Найти(Нрег(ВыборкаПоСтрокамДокумента.КонфликтныйДокумент),"возврат на работу")> 0)) Тогда  //Аверсон 26.05.2021 КВВ СВФР-007334
			//Аверсон 08.05.2021 КВВ СВФР-007558 )
			
			СтрокаСообщениеОбОшибке = "работник уже переведен в состояние """ + ВыборкаПоСтрокамДокумента.КонфликтноеСостояние + """ документом " + ВыборкаПоСтрокамДокумента.КонфликтныйДокумент + "!"; 
			
			//Аверсон ЕАЕ 22.08.2024 СВФР-013606
			//Климовичи
			//ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщениеОбОшибке, Отказ, Заголовок);
			//Если Организация.ИНН = "700103211" Тогда
				ОбщегоНазначения.СообщитьОбОшибкеСВозможностьюПроведения(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщениеОбОшибке, Заголовок);
			//Иначе
			//	ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщениеОбОшибке, Отказ, Заголовок);
			//КонецЕсли;
			//Аверсон СВФР-013606
			
		КонецЕсли;
		
		//Аверсон 27.06.2023 КВВ СВФР-011043 (
	ИначеЕсли ВыборкаПоСтрокамДокумента.КонфликтноеСостояние = NULL И ВыборкаПоСтрокамДокумента.ПричинаОтсутствия = Перечисления.СостоянияРаботникаОрганизации.Заболевание Тогда
		З = Новый Запрос;
		З.Текст = "ВЫБРАТЬ 
		|СРО.Период,
		|ДОБАВИТЬКДАТЕ(СРО.ПериодЗавершения, ДЕНЬ, -1) КАК ПериодЗавершения
		|ИЗ РегистрСведений.СостояниеРаботниковОрганизаций КАК СРО
		|ГДЕ СРО.Сотрудник = &Сотрудник
		|И СРО.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|И &ДатаПроверки МЕЖДУ СРО.Период И ДОБАВИТЬКДАТЕ(СРО.ПериодЗавершения, ДЕНЬ, -1)
		|И (СРО.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускЕжегодныйЧасть)
		|ИЛИ СРО.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускЕжегодный))";
		З.УстановитьПараметр("Сотрудник",ВыборкаПоСтрокамДокумента.Сотрудник);
		З.УстановитьПараметр("ДатаПроверки",ВыборкаПоСтрокамДокумента.ДатаНачала);
		РезЗ = З.Выполнить().Выгрузить();
		Для Каждого Стр ИЗ РезЗ Цикл
			Сообщить(СокрЛП(ВыборкаПоСтрокамДокумента.Сотрудник) + " находится в отпуске с " + Формат(Стр.Период,"ДЛФ=Д") + " по " +  Формат(Стр.ПериодЗавершения,"ДЛФ=Д")); 
		КонецЦикла;
		//Аверсон 27.06.2023 КВВ СВФР-011043 )
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиРаботникаОрганизации()

// Создает и заполняет структуру, содержащую имена регистров сведений
// по которым надо проводить документ
//
// Параметры: 
//	СтруктураПроведенияПоРегистрамСведений	- структура, содержащая имена регистров сведений 
//											  по которым надо проводить документ
//
// Возвращаемое значение:
//	Нет.
//
Процедура ЗаполнитьСтруктуруПроведенияПоРегистрамСведений(ВыборкаПоШапкеДокумента, СтруктураПроведенияПоРегистрамСведений)
	
	СтруктураПроведенияПоРегистрамСведений = Новый Структура();
	СтруктураПроведенияПоРегистрамСведений.Вставить("СостояниеРаботниковОрганизаций");
	СтруктураПроведенияПоРегистрамСведений.Вставить("ПериодыСостоянийРаботниковОрганизаций");
	
КонецПроцедуры // ЗаполнитьСтруктуруПроведенияПоРегистрамСведений

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//	ВыборкаПоШапкеДокумента					- выборка из результата запроса по шапке документа,
//	СтруктураПроведенияПоРегистрамСведений	- структура, содержащая имена регистров 
//											  сведений по которым надо проводить документ,
//  СтруктураПараметров						- структура параметров проведения,
//
// Возвращаемое значение:
//	Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизации, 
	СтруктураПроведенияПоРегистрамСведений, СтруктураПараметров = "")
	
	// Если документ нужно проводить по регистру, то для него есть ключ в структуре
	ИмяРегистра = "СостояниеРаботниковОрганизаций";
	Если СтруктураПроведенияПоРегистрамСведений.Свойство(ИмяРегистра) Тогда
		
		//Аверсон ЕАЕ 22.08.2024 СВФР-013606
		//Климовичи
		//Проверим, может быть уже есть
		ЕстьСостояние = ПроверкаСостояния(ВыборкаПоРаботникиОрганизации.ДатаНачала, ВыборкаПоРаботникиОрганизации.Сотрудник, ВыборкаПоРаботникиОрганизации.ПричинаОтсутствия);
		//Если НЕ (Организация.ИНН = "700103211" И ЕстьСостояние) Тогда
		Если НЕ ЕстьСостояние Тогда
			//Аверсон СВФР-013606
			
			Движение = Движения[ИмяРегистра].Добавить();
			
			// Свойства
			Движение.Период			= ВыборкаПоРаботникиОрганизации.ДатаНачала;
			
			// Измерения
			Движение.Сотрудник		= ВыборкаПоРаботникиОрганизации.Сотрудник;
			Движение.Организация	= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
			
			// Ресурсы
			Движение.Состояние		= ВыборкаПоРаботникиОрганизации.ПричинаОтсутствия;
		КонецЕсли;
	КонецЕсли;
	
	ИмяРегистра = "ПериодыСостоянийРаботниковОрганизаций";
	Если СтруктураПроведенияПоРегистрамСведений.Свойство(ИмяРегистра) Тогда
		
		//Аверсон ЕАЕ 22.08.2024 СВФР-013606
		//Климовичи
		//Проверим, может быть уже есть
		Если ВыборкаПоРаботникиОрганизации.ПричинаОтсутствия = Перечисления.СостоянияРаботникаОрганизации.Работает Тогда
			Нач = '00010101';
			Кон = ВыборкаПоРаботникиОрганизации.ДатаНачала;
		Иначе
			Нач = ВыборкаПоРаботникиОрганизации.ДатаНачала;
			Кон = '00010101';
		КонецЕсли;
		ЕстьПериодСостояния = ПроверкаПериодаСостояния(Нач, Кон, ВыборкаПоРаботникиОрганизации.Сотрудник);
		//Если НЕ (Организация.ИНН = "700103211" И ЕстьПериодСостояния) Тогда
		Если НЕ ЕстьПериодСостояния Тогда
		//Аверсон СВФР-013606
			
			Движение = Движения[ИмяРегистра].Добавить();
			
			// Измерения
			Движение.Сотрудник	= ВыборкаПоРаботникиОрганизации.Сотрудник;
			Если ВыборкаПоРаботникиОрганизации.ПричинаОтсутствия = Перечисления.СостоянияРаботникаОрганизации.Работает Тогда
				Движение.ДатаОкончания	= ВыборкаПоРаботникиОрганизации.ДатаНачала;
			Иначе
				Движение.ДатаНачала		= ВыборкаПоРаботникиОрганизации.ДатаНачала;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений()

// Создает и заполняет структуру, содержащую имена регистров накопления
// документа. В дальнейшем движения заносятся только по тем регистрам накопления, для которых в 
// данной процедуре заданы ключи
//
// Параметры:
//	СтруктураПроведенияПоРегистрамНакопления	- структура, содержащая имена регистров 
//												  накопления по которым надо проводить документ
//
// Возвращаемое значение:
//	Нет.
//
Процедура ЗаполнитьСтруктуруПроведенияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, СтруктураПроведенияПоРегистрамНакопления)
	
	СтруктураПроведенияПоРегистрамНакопления = Новый Структура();
	СтруктураПроведенияПоРегистрамНакопления.Вставить("ЗанятыеШтатныеЕдиницыОрганизаций");
	
КонецПроцедуры // ЗаполнитьСтруктуруПроведенияПоРегистрамНакопления()

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры:
//	ВыборкаПоШапкеДокумента						- выборка из результата запроса по шапке документа
//	СтруктураПроведенияПоРегистрамНакопления	- структура, содержащая имена регистров 
//												  накопления по которым надо проводить документ
//	СтруктураПараметров							- структура параметров проведения.
//
// Возвращаемое значение:
//	Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизации, 
	СтруктураПроведенияПоРегистрамНакопления, СтруктураПараметров = "")
	
	// Если документ нужно проводить по регистру, то для него есть ключ в структуре
	ИмяРегистра = "ЗанятыеШтатныеЕдиницыОрганизаций";
	Если СтруктураПроведенияПоРегистрамНакопления.Свойство(ИмяРегистра) Тогда
		
		Движение = Движения[ИмяРегистра].Добавить();
		
		// Свойства
		Движение.Период						= ВыборкаПоРаботникиОрганизации.ДатаНачала;
		Если ВыборкаПоРаботникиОрганизации.ПричинаОтсутствия = Перечисления.СостоянияРаботникаОрганизации.Работает Тогда
			Движение.ВидДвижения			= ВидДвиженияНакопления.Приход;
		Иначе
			Движение.ВидДвижения			= ВидДвиженияНакопления.Расход;
		КонецЕсли;
		
		// Измерения
		Движение.ПодразделениеОрганизации	= ВыборкаПоРаботникиОрганизации.ПодразделениеОрганизации;
		Движение.Должность					= ВыборкаПоРаботникиОрганизации.Должность;
		
		// Ресурсы
		Движение.КоличествоСтавок			= ВыборкаПоРаботникиОрганизации.ЗанимаемыхСтавок; 
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамНакопления()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
	//структура, содержащая имена регистров накопления, по которым надо проводить документ
	Перем СтруктураПроведенияПоРегистрамНакопления;
	
	//структура, содержащая имена регистров сведений, по которым надо проводить документ
	Перем СтруктураПроведенияПоРегистрамСведений;
	
	//структура, содержащая имена регистров расчета, по которым надо проводить документ
	Перем СтруктураПроведенияПоРегистрамРасчета;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке(Режим);
	
	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();
	
	Если ВыборкаПоШапкеДокумента.Следующий() Тогда
		
		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
		
		// Движения стоит добавлять, если в проведении еще не отказано (отказ = ложь)
		Если НЕ Отказ Тогда
			
			// Создадим и заполним структуры, содержащие имена регистров, по которым в зависимости от типа учета
			// проводится документ. В дальнейшем будем считать, что если для регистра не создан ключ в структуре,
			// то проводить по нему не надо.
			ЗаполнитьСтруктуруПроведенияПоРегистрамСведений(ВыборкаПоШапкеДокумента, СтруктураПроведенияПоРегистрамСведений);
			ЗаполнитьСтруктуруПроведенияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, СтруктураПроведенияПоРегистрамНакопления);
			
			РезультатЗапросаПоРаботники = СформироватьЗапросПоРаботникиОрганизации(ВыборкаПоШапкеДокумента);
			ВыборкаПоРаботникиОрганизации = РезультатЗапросаПоРаботники.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоРаботникиОрганизации.Следующий() Цикл 
				
				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизации, Отказ, Заголовок);
				
				Если НЕ Отказ Тогда
					
					// Заполним записи в наборах записей регистров
					ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизации, СтруктураПроведенияПоРегистрамСведений);
					
					Если ВыборкаПоРаботникиОрганизации.ОсвобождатьСтавку Тогда
						ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизации, СтруктураПроведенияПоРегистрамНакопления);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			//Аверсон 24.11.2022 КВВ СВФР-009868 (
			Если Организация.ИНН = "100194961" 
				ИЛИ Организация.ИНН = "700103211" Тогда //СВЭЙ 18.05.2024 КВВ СВФР-012908
				Отбор1 = Новый Структура();
				Отбор1.Вставить("ПричинаОтсутствия", Перечисления.СостоянияРаботникаОрганизации.Заболевание);
				НайденноеЗначение1 = РаботникиОрганизации.НайтиСтроки(Отбор1);
				ЕстьБЛ = ?(НайденноеЗначение1.Количество()>0, Истина, Ложь);
				
				//Аверсон 03.05.2023 КВВ СВФР-010777 (
				Отбор2 = Новый Структура();
				Отбор2.Вставить("ПричинаОтсутствия", Перечисления.СостоянияРаботникаОрганизации.ОтсутствиеПоИнициативеНанимателя);
				НайденноеЗначение2 = РаботникиОрганизации.НайтиСтроки(Отбор2);
				ЕстьОтстПоИницНаним = ?(НайденноеЗначение2.Количество()>0, Истина, Ложь);
				//Аверсон 03.05.2023 КВВ СВФР-010777 )
				
				СчНетДатаК = 0;
				Если ЕстьБЛ 
					ИЛИ ЕстьОтстПоИницНаним Тогда //Аверсон 03.05.2023 КВВ СВФР-010777
					СоздаватьВозврат = Истина;
					НайденноеЗначение = ?(ЕстьБЛ,НайденноеЗначение1,НайденноеЗначение2); //Аверсон 03.05.2023 КВВ СВФР-010777
					Если РаботникиОрганизации.Количество() = НайденноеЗначение.Количество() Тогда
						Для Каждого СтрНайденноеЗначение Из НайденноеЗначение Цикл
							СчНетДатаК = СчНетДатаК + ?(ЗначениеЗаполнено(СтрНайденноеЗначение.ДатаОкончания),0,1);
						КонецЦикла;	
						Если СчНетДатаК > 0 Тогда
							СоздаватьВозврат = Ложь;
							Предупреждение("В табличной части есть строки без даты окончания," + Символы.ПС + "документ ""Возврат на работу организаций"" создан не будет!");
						КонецЕсли;
					Иначе
						СоздаватьВозврат = Ложь;
						//Предупреждение("В табличной части есть не только болеющие," + Символы.ПС + "документ ""Возврат на работу организаций"" создан не будет!");
						Предупреждение("В табличной части есть не только " + ?(ЕстьБЛ,"болеющие","с отсутствием по инициативе нанимателя") + "," + Символы.ПС + "документ ""Возврат на работу организаций"" создан не будет!"); //Аверсон 03.05.2023 КВВ СВФР-010777
					КонецЕсли;
					Если СоздаватьВозврат Тогда
						ЗВ = Новый Запрос;
						ЗВ.Текст = "ВЫБРАТЬ
						|Возврат.Ссылка КАК Док
						|ИЗ Документ.ВозвратНаРаботуОрганизаций КАК Возврат
						|ГДЕ Возврат.ДокументОснование = &ТекДок";
						ЗВ.УстановитьПараметр("ТекДок",Ссылка);
						РезЗВ = ЗВ.Выполнить().Выгрузить();
						Если РезЗВ.Количество() = 0 Тогда
							НовыйДокумент = Документы.ВозвратНаРаботуОрганизаций.СоздатьДокумент();
						Иначе
							НовыйДокумент = РезЗВ[0].Док.ПолучитьОбъект();
						КонецЕсли;
						
						НовыйДокумент.Заполнить(Ссылка);
						ФормаДок = НовыйДокумент.ПолучитьФорму();
						ФормаДок.ПараметрОснование = Ссылка;
						ФормаДок.Открыть();
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			//Аверсон 24.11.2022 КВВ СВФР-009868 )
			
			//Аверсон ЕАЕ 19.08.2025 СВФР-016466
			//Виток
			Если Организация.ИНН = "100194961" Тогда
				Отбор1 = Новый Структура();
				Отбор1.Вставить("ПричинаОтсутствия", Перечисления.СостоянияРаботникаОрганизации.Простой);
				НайденноеЗначение = РаботникиОрганизации.НайтиСтроки(Отбор1);
				ЕстьПростой = ?(НайденноеЗначение.Количество() > 0, Истина, Ложь);
				Если ЕстьПростой Тогда
					СоздаватьВозврат = Истина;
					Если РаботникиОрганизации.Количество() = НайденноеЗначение.Количество() Тогда
						Для Каждого СтрНайденноеЗначение Из НайденноеЗначение Цикл
							СчНетДатаК = СчНетДатаК + ?(ЗначениеЗаполнено(СтрНайденноеЗначение.ДатаОкончания),0,1);
						КонецЦикла;	
						Если СчНетДатаК > 0 Тогда
							СоздаватьВозврат = Ложь;
							Предупреждение("В табличной части есть строки без даты окончания," + Символы.ПС + "документ ""Возврат на работу организаций"" создан не будет!");
						КонецЕсли;
					Иначе
						СоздаватьВозврат = Ложь;
						Предупреждение("В табличной части есть не только простои," + Символы.ПС + "документ ""Возврат на работу организаций"" создан не будет!"); 
					КонецЕсли;
					Если СоздаватьВозврат Тогда
						ЗВ = Новый Запрос;
						ЗВ.Текст = "ВЫБРАТЬ
						|Возврат.Ссылка КАК Док
						|ИЗ Документ.ВозвратНаРаботуОрганизаций КАК Возврат
						|ГДЕ Возврат.ДокументОснование = &ТекДок";
						ЗВ.УстановитьПараметр("ТекДок",Ссылка);
						РезЗВ = ЗВ.Выполнить().Выгрузить();
						Если РезЗВ.Количество() = 0 Тогда
							НовыйДокумент = Документы.ВозвратНаРаботуОрганизаций.СоздатьДокумент();
						Иначе
							НовыйДокумент = РезЗВ[0].Док.ПолучитьОбъект();
						КонецЕсли;
						
						НовыйДокумент.Заполнить(Ссылка);
						Попытка
							НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
						Исключение
						КонецПопытки;
						ФормаДок = НовыйДокумент.ПолучитьФорму();
						ФормаДок.ПараметрОснование = Ссылка;
						ФормаДок.Открыть();
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			//Аверсон СВФР-016466
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(РаботникиОрганизации);
	
	Движения.ПериодыСостоянийРаботниковОрганизаций.РежимЗаписиРегистратора = РежимЗаписи;
	
	//Аверсон 02.12.2022 КВВ СВФР-009868 (
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
		И (Организация.ИНН = "100194961" 
		ИЛИ Организация.ИНН = "700103211") Тогда //СВЭЙ 18.05.2024 КВВ СВФР-012908
		Для Каждого ТекСтрока ИЗ РаботникиОрганизации Цикл
			Если ТекСтрока.ПричинаОтсутствия = Перечисления.СостоянияРаботникаОрганизации.Заболевание //И ЗначениеЗаполнено(ТекСтрока.ДатаОкончания) 
				Тогда
				
				Если ЗначениеЗаполнено(ТекСтрока.ДатаОкончания) Тогда //Аверсон ЕАЕ 09.10.2025 СВФР-016968 (ищем возврат только в том случае, если заполнена дата окончания)
					
					ЗСост = Новый Запрос;
					ЗСост.Текст = "ВЫБРАТЬ 
					|Сост.Регистратор КАК Док,
					|Сост.Сотрудник
					|ИЗ РегистрСведений.СостояниеРаботниковОрганизаций КАК Сост
					|ГДЕ НАЧАЛОПЕРИОДА(Сост.Период,ДЕНЬ) = &ДатаПроверки
					|И Сост.Сотрудник = &Сотрудник
					|И Сост.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.Работает)";
					ЗСост.УстановитьПараметр("Сотрудник",ТекСтрока.Сотрудник);
					
					//Аверсон ЕАЕ 09.10.2025 СВФР-016968
					//ЗСост.УстановитьПараметр("ДатаПроверки",НачалоДня(ТекСтрока.ДатаНачала));
					ЗСост.УстановитьПараметр("ДатаПроверки",КонецДня(ТекСтрока.ДатаОкончания) + 1);
					//Аверсон СВФР-016968
					
					РезЗСост = ЗСост.Выполнить().Выгрузить();
					Если РезЗСост.Количество() <> 0 Тогда
						
						Для Каждого Стр ИЗ РезЗСост Цикл 
							ДругойДок = Стр.Док;
							Если ТипЗнч(ДругойДок) = Тип("ДокументСсылка.ВозвратНаРаботуОрганизаций")
								//И ТипЗнч(ДругойДок.ДокументОснование) = Тип("ДокументСсылка.ОтсутствиеНаРаботеОрганизаций") 
								Тогда
								ДругойДокОбъект = ДругойДок.ПолучитьОбъект();
								ДругойДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
								
								ОтборПоТЧ = Новый Структура;
								ОтборПоТЧ.Вставить("Сотрудник", ТекСтрока.Сотрудник);
								
								//Аверсон ЕАЕ 09.10.2025 СВФР-016968
								//ОтборПоТЧ.Вставить("ДатаВозврата", ТекСтрока.ДатаНачала);
								ОтборПоТЧ.Вставить("ДатаВозврата", КонецДня(ТекСтрока.ДатаОкончания) + 1);
								//Аверсон СВФР-016968
								
								ТЧДругойДокОбъект = ДругойДокОбъект.РаботникиОрганизации; 
								МассивТЧ = ТЧДругойДокОбъект.НайтиСтроки(ОтборПоТЧ); 
								Для каждого СтрокаТЧ Из МассивТЧ Цикл 
									ДругойДокОбъект.РаботникиОрганизации.Удалить(СтрокаТЧ); 
								КонецЦикла; 
								Если ДругойДокОбъект.РаботникиОрганизации.Количество() > 0 Тогда
									ДругойДокОбъект.Записать(РежимЗаписиДокумента.Проведение); 
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//Аверсон 02.12.2022 КВВ СВФР-009868 )
	
КонецПроцедуры // ПередЗаписью()

Процедура ОбработкаЗаполнения(Основание)
	
	ТипОснования = ТипЗнч(Основание);
	Если ТипОснования = Тип("ДокументСсылка.ОтсутствиеНаРаботе") Тогда
		
		// Заполним реквизиты из стандартного набора.
		ОбщегоНазначения.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		
		Если Основание.Проведен Тогда
			
			ТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
			
			Если Организация.Пустая() Тогда
				Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновнаяОрганизация")
			КонецЕсли;
			
			Запрос = Новый Запрос;
			
			Запрос.УстановитьПараметр("Основание",	Основание);
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОтсутствиеНаРаботеРаботники.Сотрудник,
			|	ОтсутствиеНаРаботеРаботники.ФизЛицо,
			|	ОтсутствиеНаРаботеРаботники.ПричинаОтсутствия,
			|	ОтсутствиеНаРаботеРаботники.ОсвобождатьСтавку,
			|	ОтсутствиеНаРаботеРаботники.ДатаНачала
			|ИЗ
			|	Документ.ОтсутствиеНаРаботе.Работники КАК ОтсутствиеНаРаботеРаботники
			|ГДЕ
			|	ОтсутствиеНаРаботеРаботники.Ссылка = &Основание";
			
			РаботникиОрганизации.Загрузить(Запрос.Выполнить().Выгрузить());
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

//Аверсон ЕАЕ 22.08.2024 СВФР-013606
Функция ПроверкаСостояния(ДатаНач, Сотр, Сост)
	ЕстьСостояние = Ложь;
	Для Каждого Стр Из Движения.СостояниеРаботниковОрганизаций Цикл
		Если Стр.Период = ДатаНач И Стр.Сотрудник = Сотр И Стр.Состояние = Сост Тогда
			ЕстьСостояние = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат ЕстьСостояние;
КонецФункции

Функция ПроверкаПериодаСостояния(ДатаНач, ДатаКон, Сотр)
	ЕстьПериодСостояния = Ложь;
	Для Каждого Стр Из Движения.ПериодыСостоянийРаботниковОрганизаций Цикл
		Если Стр.ДатаНачала = ДатаНач И Стр.ДатаОкончания = ДатаКон И Стр.Сотрудник = Сотр Тогда
			ЕстьПериодСостояния = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат ЕстьПериодСостояния;
КонецФункции
//Аверсон СВФР-013606

мДлинаСуток = 86400;
